# HW4_String_File_Processing (ไม่ลบหรือแก้ไขบรรทัดนี้ หรือเพิ่มอะไรก่อนบรรทัดนี้ โดยเด็ดขาด)

# - เขียนในเซลล์นี้เท่านั้น 
# - ถ้าต้องการเขียนฟังก์ชันเพิ่ม ก็เขียนในเซลล์นี้

# ตัวแปรต่อไปนี้เป็นตัวแปรที่กำหนดค่าสีเพื่อเอาไว้ใช้ในโปรแกรม (ห้ามแก้ไข)
RESET = '\033[0m'
RED = '\033[;31m'
GREEN = '\033[;32m'
BLUE = '\033[;34m'
HIGHLIGHT = '\033[;103m'

# ---------------------------------------------------
def red(s):
    # ลบบรรทัด pass แล้วเขียนโค้ดของนิสิตแทน
    print('red text:','\033[;31mred text\033[0m','and normal text')
red(red)
# ---------------------------------------------------
def green(s):
    # ลบบรรทัด pass แล้วเขียนโค้ดของนิสิตแทน
    print('green text:','\033[;32mgreen text\033[0m','and normal text')
green(green)
# ---------------------------------------------------
def blue(s):
    # ลบบรรทัด pass แล้วเขียนโค้ดของนิสิตแทน
    print('blue text:','\033[;34mblue text\033[0m','and normal text')
blue(blue)
 # ---------------------------------------------------
def highlight(s):
    # ลบบรรทัด pass แล้วเขียนโค้ดของนิสิตแทน
    print('highlight text:','\033[;103mhighlight text\033[0m','and normal text')
highlight(highlight)
# ---------------------------------------------------
def color_text(s, color):
    # ลบบรรทัด pass แล้วเขียนโค้ดของนิสิตแทน
    pass
# ---------------------------------------------------
def color_tag(s):
    # ลบบรรทัด pass แล้วเขียนโค้ดของนิสิตแทน
    pass
# ---------------------------------------------------
def highlight_words(s, words):
    # ลบบรรทัด pass แล้วเขียนโค้ดของนิสิตแทน
    pass
# ---------------------------------------------------
def display_tag_file(filename):
    # ลบบรรทัด pass แล้วเขียนโค้ดของนิสิตแทน
    pass